# FabricationSaveJobOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationSaveJobOptions Constructor
FabricationSaveJobOptions Class See Also
---
Default Constructor
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public FabricationSaveJobOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FabricationSaveJobOptions()
```

# See Also
FabricationSaveJobOptions Class
FabricationSaveJobOptions Overload
Autodesk.Revit.DB.Fabrication Namespace